elmot/nrf24l01-lib/demo-stm32f303-receiver/Core/Src/radio_demo.c
            UART_SendStr("Packet: #");
            UART_SendInt((uint32_t)((nRF24_payload[2] << 24) | (nRF24_payload[3] << 16) | (nRF24_payload[4] << 8) | (nRF24_payload[5])));
            UART_SendStr("\r\n");

            vrefint = (nRF24_payload[6] << 8) + nRF24_payload[7];
            UART_SendStr("Vcc: ");
            UART_SendInt(vrefint / 100);
            UART_SendChar('.');
            UART_SendInt0(vrefint % 100);
            UART_SendStr("V\r\n");

            LSI_freq = (nRF24_payload[14] << 8) + nRF24_payload[15];
            UART_SendStr("LSI: ");
            UART_SendInt(LSI_freq);
            UART_SendStr("Hz\r\nOBSERVE_TX:\r\n\t");
            UART_SendHex8(nRF24_payload[16] >> 4);
            UART_SendStr(" pckts lost\r\n\t");
            UART_SendHex8(nRF24_payload[16] & 0x0F);
            UART_SendStr(" retries\r\n");

            TR1 = nRF24_payload[8];
            TR2 = nRF24_payload[9];
            TR3 = nRF24_payload[10];
            DR1 = nRF24_payload[11];
            DR2 = nRF24_payload[12];
            DR3 = nRF24_payload[13];
            seconds = ((TR1 >> 4) * 10) + (TR1 & 0x0F);
            minutes = ((TR2 >> 4) * 10) + (TR2 & 0x0F);
            hours   = (((TR3 & 0x30) >> 4) * 10) + (TR3 & 0x0F);
            day   = ((DR1 >> 4) * 10) + (DR1 & 0x0F);
            //dow   = DR2 >> 5;
            month = (((DR2 & 0x1F) >> 4) * 10) + (DR2 & 0x0F);
            year  = ((DR3 >> 4) * 10) + (DR3 & 0x0F);

            UART_SendStr("Uptime: ");
            UART_SendInt0(hours);
            UART_SendChar(':');
            UART_SendInt0(minutes);
            UART_SendChar(':');
            UART_SendInt0(seconds);
            UART_SendChar(' ');
            UART_SendInt0(day);
            UART_SendChar('.');
            UART_SendInt0(month);
            UART_SendStr(".20");
            UART_SendInt0(year);
            UART_SendStr("\r\n");
        }
    }
#endif // DEMO_RX_SOLAR

/***************************************************************************/

#if (DEMO_TX_SINGLE)

    // This is simple transmitter (to one logic address):
    //   - TX address: '0xE7 0x1C 0xE3'
    //   - payload: 5 bytes
    //   - RF channel: 115 (2515MHz)
    //   - data rate: 250kbps (minimum possible, to increase reception reliability)
    //   - CRC scheme: 2 byte

    // The transmitter sends a 5-byte packets to the address '0xE7 0x1C 0xE3' without Auto-ACK (ShockBurst disabled)

    // Disable ShockBurst for all RX pipes
    nRF24_DisableAA(0xFF);

    // Set RF channel
    nRF24_SetRFChannel(115);

    // Set data rate
    nRF24_SetDataRate(nRF24_DR_250kbps);

    // Set CRC scheme
    nRF24_SetCRCScheme(nRF24_CRC_2byte);

    // Set address width, its common for all pipes (RX and TX)
    nRF24_SetAddrWidth(3);

    // Configure TX PIPE
    static const uint8_t nRF24_ADDR[] = { 0xE7, 0x1C, 0xE3 };
    nRF24_SetAddr(nRF24_PIPETX, nRF24_ADDR); // program TX address

    // Set TX power (maximum)
    nRF24_SetTXPower(nRF24_TXPWR_0dBm);

    // Set operational mode (PTX == transmitter)
    nRF24_SetOperationalMode(nRF24_MODE_TX);

    // Clear any pending IRQ flags
    nRF24_ClearIRQFlags();

    // Wake the transceiver
    nRF24_SetPowerMode(nRF24_PWR_UP);


    // The main loop
    j = 0;
    payload_length = 5;
    while (1) {
        // Prepare data packet
        for (i = 0; i < payload_length; i++) {
            nRF24_payload[i] = j++;
            if (j > 0x000000FF) j = 0;
        }

        // Print a payload
        UART_SendStr("PAYLOAD:>");
        UART_SendBufHex((char *)nRF24_payload, payload_length);
        UART_SendStr("< ... TX: ");

        // Transmit a packet
        tx_res = nRF24_TransmitPacket(nRF24_payload, payload_length);
        switch (tx_res) {
            case nRF24_TX_SUCCESS:
                UART_SendStr("OK");
                break;
            case nRF24_TX_TIMEOUT:
                UART_SendStr("TIMEOUT");
                break;
            case nRF24_TX_MAXRT:
                UART_SendStr("MAX RETRANSMIT");
                break;
            default:
                UART_SendStr("ERROR");
                break;
        }
        UART_SendStr("\r\n");

        // Wait ~0.5s
        Delay_ms(500);
    }

#endif // DEMO_TX_SINGLE

/***************************************************************************/

#if (DEMO_TX_MULTI)

    // This is simple transmitter (to multiple logic addresses):
    //   - TX addresses and payload lengths:
    //       'WBC', 11 bytes
    //       '0xE7 0x1C 0xE3', 5 bytes
    //       '0xE7 0x1C 0xE6', 32 bytes
    //   - RF channel: 115 (2515MHz)
    //   - data rate: 250kbps (minimum possible, to increase reception reliability)
    //   - CRC scheme: 2 byte

    // The transmitter sends a data packets to the three logic addresses without Auto-ACK (ShockBurst disabled)
    // The payload length depends on the logic address

    // Disable ShockBurst for all RX pipes
    nRF24_DisableAA(0xFF);

    // Set RF channel
    nRF24_SetRFChannel(115);

    // Set data rate
    nRF24_SetDataRate(nRF24_DR_250kbps);

    // Set CRC scheme
    nRF24_SetCRCScheme(nRF24_CRC_2byte);

    // Set address width, its common for all pipes (RX and TX)
    nRF24_SetAddrWidth(3);

    // Set TX power (maximum)
    nRF24_SetTXPower(nRF24_TXPWR_0dBm);

    // Set operational mode (PTX == transmitter)
    nRF24_SetOperationalMode(nRF24_MODE_TX);

    // Clear any pending IRQ flags
    nRF24_ClearIRQFlags();

    // Wake the transceiver
    nRF24_SetPowerMode(nRF24_PWR_UP);

    static const uint8_t nRF24_ADDR0[] = { 'W', 'B', 'C' };
    static const uint8_t nRF24_ADDR1[] = { 0xE7, 0x1C, 0xE3 };
    static const uint8_t nRF24_ADDR2[] = { 0xE7, 0x1C, 0xE6 };

    // The main loop
    j = 0; pipe = 0;
    while (1) {
        // Logic address
        UART_SendStr("ADDR#");
        UART_SendInt(pipe);

        // Configure the TX address and payload length
        switch (pipe) {
            case 0:
                // addr #1
                nRF24_SetAddr(nRF24_PIPETX, nRF24_ADDR0);
                payload_length = 11;
                break;
            case 1:
                // addr #2
                nRF24_SetAddr(nRF24_PIPETX, nRF24_ADDR1);
                payload_length = 5;
                break;
            case 2:
                // addr #3
                nRF24_SetAddr(nRF24_PIPETX, nRF24_ADDR2);
                payload_length = 32;
                break;
            default:
                break;
        }

        // Prepare data packet
        for (i = 0; i < payload_length; i++) {
            nRF24_payload[i] = j++;
            if (j > 0x000000FF) j = 0;
        }

        // Print a payload
        UART_SendStr(" PAYLOAD:>");
        UART_SendBufHex((char *)nRF24_payload, payload_length);
        UART_SendStr("< ... TX: ");

        // Transmit a packet
        tx_res = nRF24_TransmitPacket(nRF24_payload, payload_length);
        switch (tx_res) {
            case nRF24_TX_SUCCESS:
                UART_SendStr("OK");
                break;
            case nRF24_TX_TIMEOUT:
                UART_SendStr("TIMEOUT");
                break;
            case nRF24_TX_MAXRT:
                UART_SendStr("MAX RETRANSMIT");
                break;
            default:
                UART_SendStr("ERROR");
                break;
        }
        UART_SendStr("\r\n");

        // Proceed to next address
        pipe++;
        if (pipe > 2) {
            pipe = 0;
        }

        // Wait ~0.5s
        Delay_ms(500);
    }

#endif // DEMO_TX_MULTI

/***************************************************************************/

#if (DEMO_RX_SINGLE_ESB)

    // This is simple receiver with Enhanced ShockBurst:
    //   - RX address: 'ESB'
    //   - payload: 10 bytes
    //   - RF channel: 40 (2440MHz)
    //   - data rate: 2Mbps
    //   - CRC scheme: 2 byte

    // The transmitter sends a 10-byte packets to the address 'ESB' with Auto-ACK (ShockBurst enabled)

    // Set RF channel
    nRF24_SetRFChannel(40);

